Delans-TLE/src/Documents/ES_МатрицаЗон/ES_МатрицаЗон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ES_МатрицаЗон</name>
  <registerRecords>InformationRegister.ES_МатрицаЗон</registerRecords>
  <tabularSections>
    <name>ЗоныТЧ</name>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ES_ЗоныДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Направление</name>
      <type>
        <types>CatalogRef.ES_Направления</types>
      </type>
    </attributes>
    <attributes>
      <name>Срочность</name>
      <type>
        <types>EnumRef.ES_СрочностьДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидКонтрагента</name>
      <type>
        <types>EnumRef.ES_ВидКонтрагента</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Delans-TLE/src/InformationRegisters/ES_МатрицаЗон/ES_МатрицаЗон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ES_МатрицаЗон</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Зона</name>
    <type>
      <types>CatalogRef.ES_ЗоныДоставки</types>
    </type>
  </resources>
  <resources>
    <name>СрокДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>CatalogRef.ES_Направления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукт</name>
    <type>
      <types>EnumRef.ES_СрочностьДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ES_ВидКонтрагента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/Documents/ES_МатрицаЗон/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ES_МатрицаЗон.Записывать = Истина;
	Для Каждого ТекСтрокаЗоныТЧ Из ЗоныТЧ Цикл
		Движение = Движения.ES_МатрицаЗон.Добавить();
		Движение.Период = Дата;
		Движение.Направление = ТекСтрокаЗоныТЧ.Направление;
		Движение.Продукт = ТекСтрокаЗоныТЧ.Срочность;
		Движение.Зона = ТекСтрокаЗоныТЧ.Зона;
		Движение.СрокДоставки = ТекСтрокаЗоныТЧ.СрокДоставки;
		Движение.ВидКонтрагента = ТекСтрокаЗоныТЧ.ВидКонтрагента;
	КонецЦикла;

КонецПроцедуры
